In [1]:
import pandas as pd
import numpy as np

In [2]:
dframe = pd.read_csv("./adult.csv")
dframe.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [8]:
males_count = len(dframe[dframe['sex'] == 'Male'])
print(f'Males count = {males_count}')
females_count = len(dframe[dframe['sex'] == 'Female'])
print(f'Females count = {females_count}')

Males count = 21790
Males count = 10771

In [9]:
mean_female_age = dframe[dframe['sex'] == 'Female']['age'].mean()
print(f'Mean age of females = {mean_female_age}')

Mean age of females = 36.85823043357163

In [13]:
percentage_of_germans = len(dframe[dframe['native-country'] == 'Germany']) / len(dframe) * 100
print(f'Percent of germans = {percentage_of_germans}')

Percent of germans = 0.42074874850281013

In [18]:
more50k_mean = dframe[dframe['salary'] == '>50K']['age'].mean()
more50k_std = dframe[dframe['salary'] == '>50K']['age'].std()
print(f'More than 50K salary mean age = {more50k_mean}, std age = {more50k_std}')

less50k_mean = dframe[dframe['salary'] == '<=50K']['age'].mean()
less50k_std = dframe[dframe['salary'] == '<=50K']['age'].std()
print(f'Less than 50K salary mean age = {less50k_mean}, std age = {less50k_std}')

More than 50K salary mean age = 44.24984058155847, std age = 10.51902771985177
Less than 50K salary mean age = 36.78373786407767, std age = 14.020088490824813

In [19]:
dframe.groupby('education')[['age']].mean()

                    age
education
10th          37.429796
11th          32.355745
12th          32.000000
1st-4th       46.142857
5th-6th       42.885886
7th-8th       48.445820
9th           41.060311
Assoc-acdm    37.381443
Assoc-voc     38.553546
Bachelors     38.904949
Doctorate     47.702179
HS-grad       38.974479
Masters       44.049913
Preschool     42.764706
Prof-school   44.746528
Some-college  35.756275

In [31]:
all_has_ed = (dframe[dframe['salary'] == '>50K'].isin(dframe['education'].isin(['Bachelors', 'Doctorate', 'Masters', 'Prof-school', 'HS-grad']))).all().all()
print(f'Does everyone who earns more than 50K have high-school educatuion: {all_has_ed}')

Does everyone who earns more than 50K have high-school educatuion: False

In [35]:
dframe.groupby('race')['age'].describe()

,count,mean,std,min,25%,50%,75%,max
race,,,,,,,,
Amer-Indian-Eskimo,311.0,37.173633,12.447130,17.0,28.0,35.0,45.5,82.0
Asian-Pac-Islander,1039.0,37.746872,12.825133,17.0,28.0,36.0,45.0,90.0
Black,3124.0,37.767926,12.759290,17.0,28.0,36.0,46.0,90.0
Other,271.0,33.457565,11.538865,17.0,25.0,31.0,41.0,77.0
White,27816.0,38.769881,13.782306,17.0,28.0,37.0,48.0,90.0

In [36]:
dframe.groupby('sex')['age'].describe()

          count       mean        std   min   25%   50%   75%   max
sex
Female  10771.0  36.858230  14.013697  17.0  25.0  35.0  46.0  90.0
Male    21790.0  39.433547  13.370630  17.0  29.0  38.0  48.0  90.0

In [37]:
max_aie_race_age = dframe[dframe['race'] == 'Amer-Indian-Eskimo']['age'].max()
print(f'Max age of Amer-Indian-Eskimo race is : {max_aie_race_age}')

Max age of Amer-Indian-Eskimo race is : 82

In [57]:
grouped = dframe[dframe['salary'] == '>50K'].groupby('marital-status')['marital-status'].count()
total = grouped.sum()
percent_unmarried =  grouped[['Divorced', 'Never-married', 'Separated', 'Widowed']].sum() / total * 100
percent_married =  grouped[['Married-AF-spouse', 'Married-civ-spouse', 'Married-spouse-absent']].sum() / total * 100
print(f'Percent of married with high income = {percent_married}')
print(f'Percent of not married with high income = {percent_unmarried}')
grouped

Percent of married with high income = 85.9074097691621
Percent of not married with high income = 14.092590230837903

marital-status
Divorced                  463
Married-AF-spouse          10
Married-civ-spouse       6692
Married-spouse-absent      34
Never-married             491
Separated                  66
Widowed                    85
Name: marital-status, dtype: int64

In [64]:
max_hours = dframe['hours-per-week'].max()
print(f'Max working hours: {max_hours}')
filtered = dframe[dframe['hours-per-week'] == max_hours]

count_of_max_hours_workers = filtered['age'].count()
print(f'Count of people with max working hours: {count_of_max_hours_workers}')

percent_of_hgh_salary = filtered[filtered['salary'] == '>50K']['age'].count() / count_of_max_hours_workers * 100
print(f'Percent of people with max working hours with high salary: {percent_of_hgh_salary}')

Max working hours: 99
Count of people with max working hours: 85
Percent of people with max working hours with high salary: 29.411764705882355

In [66]:
mean_hours_low_salary = dframe[dframe['salary'] == '<=50K']['hours-per-week'].mean()
mean_hours_hign_salary = dframe[dframe['salary'] == '>50K']['hours-per-week'].mean()
print(f'Mean hours for low salary = {mean_hours_low_salary}, high = {mean_hours_hign_salary}')

mean_hours_low_salary_jp = dframe[(dframe['salary'] == '<=50K') & (dframe['native-country'] == 'Japan')]['hours-per-week'].mean()
mean_hours_hign_salary_jp = dframe[(dframe['salary'] == '>50K') & (dframe['native-country'] == 'Japan')]['hours-per-week'].mean()
print(f'Mean hours in Japan for low salary = {mean_hours_low_salary_jp}, high = {mean_hours_hign_salary_jp}')

Mean hours for low salary = 38.840210355987054, high = 45.473026399693914
Mean hours in Japan for low salary = 41.0, high = 47.958333333333336